common/xrd-ui-tests-qautomate/data/soap/requests/request_helloService.xml

<soapenv:Envelope 
xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:foo="http://temp.uri/foo"
xmlns:xro="http://x-road.eu/xsd/xroad.xsd"
xmlns:iden="http://x-road.eu/xsd/identifiers"
xmlns:prod="http://test.x-road.fi/producer">
   <soapenv:Header>
      <xro:protocolVersion>4.0</xro:protocolVersion>
      <xro:id>ID11234</xro:id>
      <xro:userId>EE1234567890</xro:userId>
      <xro:client iden:objectType="SUBSYSTEM">
         <iden:xRoadInstance>test</iden:xRoadInstance>
         <iden:memberClass>GOV</iden:memberClass>
         <iden:memberCode>1234567-8</iden:memberCode>
         <iden:subsystemCode>GUITEST</iden:subsystemCode>
      </xro:client>
      <xro:service iden:objectType="SERVICE">
         <iden:xRoadInstance>test</iden:xRoadInstance>
         <iden:memberClass>GOV</iden:memberClass>
         <iden:memberCode>1234567-8</iden:memberCode>
         <iden:subsystemCode>GUITEST</iden:subsystemCode>
         <iden:serviceCode>helloService</iden:serviceCode>
         <iden:serviceVersion>v1</iden:serviceVersion>
      </xro:service>
   </soapenv:Header>
   <soapenv:Body>
      <prod:helloService>
      <prod:request>
      <prod:name>gui_test</prod:name>
      </prod:request>
      </prod:helloService>
   </soapenv:Body>
</soapenv:Envelope>